In [7]:
x= 1

if x > 3:
    print('case 1')
if x <=3:
    print ('case 2')

case 2

In [9]:
x= 5 
if x >= 3:
    print('mayor o igual')
else:
    print('menor')

mayor o igual

In [11]:
def compare_to_five(y):
    if y > 5:
        print('Greater')
    elif y < 5:
        print('less')
    else:
        print ('other')

In [16]:
compare_to_five(5)

other

In [19]:
def compare_to_six(y):
    if y > 6:
        return 'greater'
    elif y < 6:
        return 'less'
    else:
        return 'other'

In [22]:
print(compare_to_six(2))

less

In [15]:
def hello (y):
    if y >10:
        return 'hey'
    elif y < 10:
        return 'not ready yet'

In [16]:
print(hello(4))

not ready yet

In [17]:
def plus_ten(a):
    return a + 10

In [18]:
print(plus_ten(3))

13

In [3]:
def multiplication_by_2(x):
    result = x*2
    print('Outcome')
    return result

In [4]:
print( multiplication_by_2(5))

Outcome
10

# Conditional statements in a function.

In [5]:
def add_10(m):
    if m>=100:
        return m +10
    else:
        return"save more"

In [8]:
add_10(90)

'save more'

In [2]:
import pandas as pd

data = {

'Name':['Amy White', 'Jack Stewart','Richard Lauderdale','Sara Johnson'],
'Age':[50,53,35,43],
'Working Experience(Yrs.)':[5,8,3,10],
}

df= pd.DataFrame(data)

                 Name  Age  Working Experience(Yrs.)
0           Amy White   50                         5
1        Jack Stewart   53                         8
2  Richard Lauderdale   35                         3
3        Sara Johnson   43                        10

In [3]:
df

                 Name  Age  Working Experience(Yrs.)
0           Amy White   50                         5
1        Jack Stewart   53                         8
2  Richard Lauderdale   35                         3
3        Sara Johnson   43                        10

In [6]:
import pandas as pd

data= [
    {'Name':'Amy White','Age': 50,'working Experience(Yrs.)':5},
    {'Name':'Jack Stewart','Age': 53,'working Experience(Yrs.)':8},
    {'Name':'Richard Lauderdale','Age': 35 ,'working Experience(Yrs.)':3},
    {'Name':'Sara Johnson','Age': 43 ,'working Experience(Yrs.)':10}
    
]

df= pd.DataFrame(data)

In [10]:
df= pd.DataFrame(data)

df

                 Name  Age  working Experience(Yrs.)
0           Amy White   50                         5
1        Jack Stewart   53                         8
2  Richard Lauderdale   35                         3
3        Sara Johnson   43                        10

In [8]:
import pandas as  pd

names = pd.Series(['Amy White','Jack Stewart','Richard Lauderdale','Sara Jonhson'])
age = pd.Series([50,53,35,43])
working_experience_yrs = pd.Series([5,8,3,10])

data={
    'Name':names,
    'Age':age,
    'Working Experiences(Yrs.)':working_experience_yrs
    }

df = pd.DataFrame(data)

In [9]:
df

                 Name  Age  Working Experiences(Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Jonhson   43                         10

In [25]:
import pandas as pd
data = [
['Amy White',50,5],
['Jack Stewart',53,8],
['Richard Lauderdale',35,3],
['Sara Johnson',43,10]
]

In [26]:
df = pd.DataFrame(data, columns=[ 'Name', 'Age','Working Experiences(Yrs.)'])

In [27]:
df

                 Name  Age  Working Experiences(Yrs.)
0           Amy White   50                          5
1        Jack Stewart   53                          8
2  Richard Lauderdale   35                          3
3        Sara Johnson   43                         10